<font size="+3"><strong>Pandas: Advanced</strong></font>

# Calculate Summary Statistics for a DataFrame or Series

Many datasets are large, and it can be helpful to get a summary of information in them. Let's load a dataset and examine the first few rows:

In [1]:
import pandas as pd

mexico_city1 = pd.read_csv("./data/mexico-city-real-estate-1.csv")
mexico_city1.head()

,operation,property_type,place_with_parent_names,lat-lon,price,currency,price_aprox_local_currency,price_aprox_usd,surface_total_in_m2,surface_covered_in_m2,price_usd_per_m2,price_per_m2,floor,rooms,expenses,properati_url
0,sell,apartment,|México|Distrito Federal|Álvaro Obregón|,NaN,35000000.0,MXN,35634500.02,1894595.53,NaN,NaN,NaN,NaN,NaN,NaN,NaN,http://alvaro-obregon.properati.com.mx/2eb_ven...
1,sell,apartment,|México|Distrito Federal|Benito Juárez|,NaN,2000000.0,MXN,2036257.11,108262.60,NaN,NaN,NaN,NaN,NaN,NaN,NaN,http://benito-juarez.properati.com.mx/2ec_vent...
2,sell,apartment,|México|Distrito Federal|Cuauhtémoc|,"19.41501,-99.175174",2700000.0,MXN,2748947.10,146154.51,61.0,61.0,2395.975574,44262.295082,NaN,3.0,NaN,http://cuauhtemoc.properati.com.mx/2pu_venta_a...
3,sell,apartment,|México|Distrito Federal|Cuauhtémoc|,"19.41501,-99.175174",6347000.0,MXN,6462061.92,343571.36,176.0,128.0,1952.110000,49585.937500,NaN,5.0,NaN,http://cuauhtemoc.properati.com.mx/2pv_venta_a...
4,sell,apartment,|México|Distrito Federal|Álvaro Obregón|,NaN,6870000.0,MXN,6994543.16,371882.03,180.0,136.0,2066.011278,50514.705882,NaN,5.0,NaN,http://alvaro-obregon.properati.com.mx/2pw_ven...

Let's get a summary description of this dataset.

In [3]:
mexico_city1.isnull().sum()

operation                        0
property_type                    0
place_with_parent_names          0
lat-lon                        848
price                           33
currency                        33
price_aprox_local_currency      33
price_aprox_usd                 33
surface_total_in_m2            941
surface_covered_in_m2          129
price_usd_per_m2              1716
price_per_m2                   230
floor                         3216
rooms                         3589
expenses                      3791
properati_url                    0
dtype: int64

In [2]:
mexico_city1.describe()

,price,price_aprox_local_currency,price_aprox_usd,surface_total_in_m2,surface_covered_in_m2,price_usd_per_m2,price_per_m2,floor,rooms,expenses
count,3.758000e+03,3.758000e+03,3.758000e+03,2850.000000,3662.000000,2075.000000,3561.000000,575.000000,202.000000,0.0
mean,5.015710e+06,9.553774e+06,5.079498e+05,292.954386,250.817313,1906.810070,24475.917409,3.627826,3.039604,NaN
std,7.355006e+06,1.544553e+07,8.211993e+05,1816.296990,336.555251,1813.415255,27430.941809,22.425889,1.410132,NaN
min,1.485000e+05,1.471566e+05,7.823940e+03,0.000000,0.000000,1.034212,98.221416,1.000000,1.000000,NaN
25%,1.068000e+06,1.585902e+06,8.431836e+04,0.000000,70.000000,669.510272,8684.210526,2.000000,2.000000,NaN
50%,2.550000e+06,4.031164e+06,2.143267e+05,100.000000,146.500000,1415.132810,17460.317460,2.000000,3.000000,NaN
75%,5.833201e+06,1.228003e+07,6.528979e+05,275.750000,310.000000,2498.628385,35810.810811,3.000000,4.000000,NaN
max,1.250000e+08,3.364841e+08,1.789000e+07,84500.000000,8265.000000,28396.825397,750000.000000,450.000000,9.000000,NaN

Like most large datasets, this one has many missing values which are missing. The describe function will ignore missing values in each column. You can also remove rows and columns with missing values, and then get a summary of the data that's still there. We need to remove columns first, before removing the rows; the sequence of operations here is important. The code looks like this:

In [ ]:
mexico_city1 = mexico_city1.drop(
    ["floor", "price_usd_per_m2", "expenses", "rooms"], axis=1
)
mexico_city1 = mexico_city1.dropna(axis=0)
mexico_city1.head()

Let's take a look at our new, cleaner dataset.

In [ ]:
mexico_city1.describe()

<font size="+1">Practice</font> 

Reload the `mexico-city-real-estate-1.csv` dataset. Reverse the sequence of operations by first dropping all rows where there is a missing value, and then dropping the columns, `floor`, `price_usd_per_m2`,`expenses` and `rooms`. What is the size of the resulting DataFrame?

In [ ]:
mexico_city1 = pd.read_csv("./data/mexico-city-real-estate-1.csv")
mexico_city1 = ...
mexico_city1 = mexico_city1.drop(
    ["floor", "price_usd_per_m2", "expenses", "rooms"], axis=1
)  # REMOVERHS
print(mexico_city1.shape)

# Select a Series from a DataFrame

Since the datasets we work with are so large, you might want to focus on a single column of a DataFrame. Let's load up the `mexico-city-real-estate-2` dataset, and examine the first few rows to find the column names.

In [9]:
curr = mexico_city2["currency"].unique()
curr

array(['MXN', 'USD', nan], dtype=object)

In [10]:
prop = mexico_city2["property_type"].unique()
prop

array(['apartment', 'house', 'store', 'PH'], dtype=object)

In [15]:
mexico_city2 = pd.read_csv("./data/mexico-city-real-estate-2.csv")
mexico_city2.head()

,operation,property_type,place_with_parent_names,lat-lon,price,currency,price_aprox_local_currency,price_aprox_usd,surface_total_in_m2,surface_covered_in_m2,price_usd_per_m2,price_per_m2,floor,rooms,expenses,properati_url
0,sell,apartment,|México|Distrito Federal|Benito Juárez|,"19.375445,-99.1543144",4300500.0,MXN,4261596.45,226578.22,0.0,74.0,NaN,58114.864865,NaN,NaN,NaN,http://benito-juarez.properati.com.mx/l1yl_ven...
1,sell,apartment,|México|Distrito Federal|Tlalpan|,"19.2742408542,-99.1496908665",2788000.0,MXN,2762778.87,146889.91,0.0,111.0,NaN,25117.117117,NaN,NaN,NaN,http://tlalpan.properati.com.mx/l1ym_venta_dep...
2,sell,apartment,|México|Distrito Federal|Álvaro Obregón|Tetelpan|,"19.3427189674,-99.2225289345",3351600.0,MXN,3321280.35,176584.01,0.0,82.0,NaN,40873.170732,NaN,NaN,NaN,http://tetelpan.properati.com.mx/l1yn_venta_de...
3,sell,apartment,|México|Distrito Federal|Benito Juárez|,"19.3596034,-99.1514055",2862800.0,MXN,2836902.23,150830.86,73.0,73.0,2066.176164,39216.438356,NaN,NaN,NaN,http://benito-juarez.properati.com.mx/l1yo_ven...
4,sell,apartment,|México|Distrito Federal|Benito Juárez|,"19.3953378,-99.1560855",3204800.0,MXN,3175808.45,168849.64,0.0,63.0,NaN,50869.841270,NaN,NaN,NaN,http://benito-juarez.properati.com.mx/l1yp_ven...

Maybe we're interested in the `surface_covered_in_m2` column. The code to extract just that one column looks like this:

In [11]:
surface_covered_in_m2 = mexico_city2["surface_covered_in_m2"]
surface_covered_in_m2

0        74.0
1       111.0
2        82.0
3        73.0
4        63.0
        ...
3786     98.0
3787     60.0
3788     84.0
3789     66.0
3790     80.0
Name: surface_covered_in_m2, Length: 3791, dtype: float64

<font size="+1">Practice</font> 

Select the `price` series from the `mexico-city-real-estate-2` dataset, and load it into the `mexico_city2` DataFrame

In [ ]:
price = ...
print(price)

# Subset a DataFrame by Selecting One or More Columns

You may find it more efficient to work with a smaller portion of a dataset that's relevant to you. One way to do this is to select some columns from a DataFrame and make a new DataFrame with them. Let's load a dataset to do this and examine the first few rows to find the column headings:

In [ ]:
mexico_city4 = pd.read_csv("./data/mexico-city-real-estate-4.csv")
mexico_city4.head

Let's choose `"operation"`, `"property_type"`, `"place_with_parent_names"`, and `"price"`:

In [ ]:
mexico_city4_subset = mexico_city4[
    ["operation", "property_type", "place_with_parent_names", "price"]
]

Once we've done that, we can find the resulting number of entries in the DataFrame:

In [ ]:
mexico_city4_subset.shape

<font size="+1">Practice</font> 

Load the `mexico-city-real-estate-1.csv` dataset and subset it to obtain the `operation`, `lat-lon` and `place_with_property_names` columns only. How many entries are in the resulting DataFrame?

In [ ]:
mexico_city1 = ...
mexico_city1_subset = mexico_city1[
    ["operation", "lat-lon", "place_with_parent_names"]
]  # REMOVERHS
print(mexico_city1_subset.shape)

# Subset the Columns of a DataFrame Based on Data Types

It's helpful to be able to find specific types of entries &mdash; typically numeric ones &mdash; and put all of these in a separate DataFrame. First, let's take a look at the `mexico-city-real-estate-5` dataset.

In [14]:
mexico_city5 = pd.read_csv("./data/mexico-city-real-estate-5.csv")
mexico_city5.head()

,operation,property_type,place_with_parent_names,lat-lon,price,currency,price_aprox_local_currency,price_aprox_usd,surface_total_in_m2,surface_covered_in_m2,price_usd_per_m2,price_per_m2,floor,rooms,expenses,properati_url
0,sell,store,|México|Distrito Federal|Cuauhtémoc|,"19.4377047567,-99.1511714458",1950000.0,MXN,1932817.88,102763.00,63.0,63.0,1631.158730,30952.380952,NaN,NaN,NaN,http://cuauhtemoc.properati.com.mx/pms1_venta_...
1,sell,house,|México|Distrito Federal|Coyoacán|,"19.317018,-99.130739",3990000.0,MXN,3953905.37,210219.07,NaN,210.0,NaN,19000.000000,NaN,NaN,NaN,http://coyoacan.properati.com.mx/pmsd_venta_ca...
2,sell,house,|México|Distrito Federal|Cuajimalpa de Morelos|,"19.4032060441,-99.246864114",2000000.0,USD,37617000.00,2000000.00,1000.0,1000.0,2000.000000,2000.000000,NaN,NaN,NaN,http://cuajimalpa-de-morelos.properati.com.mx/...
3,sell,apartment,|México|Distrito Federal|Venustiano Carranza|,"19.438641,-99.098522",748000.0,MXN,741233.20,39409.48,NaN,52.0,NaN,14384.615385,NaN,NaN,NaN,http://venustiano-carranza.properati.com.mx/pm...
4,sell,house,|México|Distrito Federal|Miguel Hidalgo|,NaN,15500000.0,MXN,15363425.29,816834.16,197.0,197.0,4146.366294,78680.203046,NaN,NaN,NaN,http://miguel-hidalgo-df.properati.com.mx/pmv1...

The code to subset just the numerical entries looks like this:

In [16]:
mexico_city5.select_dtypes(include = "float").head()

,price,price_aprox_local_currency,price_aprox_usd,surface_total_in_m2,surface_covered_in_m2,price_usd_per_m2,price_per_m2,floor,rooms,expenses
0,1950000.0,1932817.88,102763.00,63.0,63.0,1631.158730,30952.380952,NaN,NaN,NaN
1,3990000.0,3953905.37,210219.07,NaN,210.0,NaN,19000.000000,NaN,NaN,NaN
2,2000000.0,37617000.00,2000000.00,1000.0,1000.0,2000.000000,2000.000000,NaN,NaN,NaN
3,748000.0,741233.20,39409.48,NaN,52.0,NaN,14384.615385,NaN,NaN,NaN
4,15500000.0,15363425.29,816834.16,197.0,197.0,4146.366294,78680.203046,NaN,NaN,NaN

In [13]:
mexico_city5.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3791 entries, 0 to 3790
Data columns (total 16 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   operation                   3791 non-null   object
 1   property_type               3791 non-null   object
 2   place_with_parent_names     3791 non-null   object
 3   lat-lon                     3544 non-null   object
 4   price                       3786 non-null   float64
 5   currency                    3786 non-null   object
 6   price_aprox_local_currency  3786 non-null   float64
 7   price_aprox_usd             3786 non-null   float64
 8   surface_total_in_m2         698 non-null    float64
 9   surface_covered_in_m2       3653 non-null   float64
 10  price_usd_per_m2            474 non-null    float64
 11  price_per_m2                3596 non-null   float64
 12  floor                       23 non-null     float64
 13  rooms                       43 non-null     float64
 14  expenses                    11 non-null     float64
 15  properati_url               3791 non-null   object
dtypes: float64(10), object(6)
memory usage: 474.0+ KB

In [ ]:
mexico_city5_numbers = mexico_city5.select_dtypes(include="number")
mexico_city5_numbers.head()

<font size="+1">Practice</font> 

Create a subset of the DataFrame from `mexico-city-real-estate-5` which excludes numbers.

In [ ]:
mexico_city3 = ...
mexico_city3_no_numbers = ...
print(mexico_city3_no_numbers.shape)

# Working with value_counts in a Series

In order to use the data in a series for other types of analysis, it might be helpful to know how often each value occurs in the Series. To do that, we use the `value_counts` method to aggregate the data. Let's take a look at the number of properties associated with each department in the `colombia-real-estate-1` dataset.

In [18]:
df1 = pd.read_csv("data/colombia-real-estate-1.csv", usecols=["department"])
df1["department"].value_counts()

Bogotá D.C                                 1510
Atlántico                                   554
Cundinamarca                                360
Valle del Cauca                             319
Antioquia                                   105
Bolívar                                      66
Caldas                                       43
Quindío                                      32
Magdalena                                    29
Tolima                                       14
Santander                                    12
Meta                                          8
Boyacá                                        6
Risaralda                                     3
Sucre                                         3
San Andrés Providencia y Santa Catalina       1
Huila                                         1
Name: department, dtype: int64

<font size="+1">Practice</font>

Try it yourself! Aggregate the different property types in the `colombia-real-estate-2` dataset.

In [ ]:
df2 = ...

# Masking

In [21]:
df1.info

<bound method DataFrame.info of         department
0       Bogotá D.C
1       Bogotá D.C
2          Quindío
3       Bogotá D.C
4        Atlántico
...            ...
3061    Bogotá D.C
3062       Bolívar
3063  Cundinamarca
3064    Bogotá D.C
3065    Bogotá D.C

[3066 rows x 1 columns]>

In [31]:
df1 = pd.read_csv("data/colombia-real-estate-1.csv")
df1.head()

  property_type  department     lat     lon  area_m2    price_usd
0         house  Bogotá D.C   4.690 -74.048    187.0  $330,899.98
1         house  Bogotá D.C   4.695 -74.082     82.0  $121,555.09
2         house     Quindío   4.535 -75.676    235.0  $219,474.47
3         house  Bogotá D.C   4.620 -74.129    195.0   $97,919.38
4         house   Atlántico  11.012 -74.834    112.0  $115,477.34

In [25]:
df1["property_type"].unique()

array(['house', 'apartment'], dtype=object)

In [34]:
mask = (df1["property_type"] == "apartment") & (df1["department"] == "Quindío")

In [35]:
newdf = df1[mask]
newdf

Empty DataFrame
Columns: [property_type, department, lat, lon, area_m2, price_usd]
Index: []

In [33]:
qmask = (df1["department"] == "Quindío")

quindo_df = df1[qmask]
quindo_df.head()

    property_type department    lat     lon  area_m2    price_usd
2           house    Quindío  4.535 -75.676    235.0  $219,474.47
79          house    Quindío  4.480 -75.753    300.0  $472,714.25
145         house    Quindío  4.549 -75.660     72.0   $65,842.34
347         house    Quindío  4.551 -75.657    147.0  $118,178.56
356         house    Quindío  4.515 -75.733    200.0  $185,709.17

# Series and `Groupby`

Large Series often include data points that have some attribute in common, but which are nevertheless not grouped together in the dataset. Happily, pandas has a method that will bring these data points together into groups. 

Let's take a look at the `colombia-real-estate-1` dataset. The set includes properties scattered across Colombia, so it might be useful to group properties from the same department together; to do this, we'll use the `groupby` method. The code looks like this:

In [19]:
dept_group = df1.groupby("department")
#dept_group.head()

To make sure we got all the departments in the dataset, let's print the first occurrence of each department.

In [20]:
dept_group.first()

Empty DataFrame
Columns: []
Index: [Antioquia, Atlántico, Bogotá D.C, Bolívar, Boyacá, Caldas, Cundinamarca, Huila, Magdalena, Meta, Quindío, Risaralda, San Andrés Providencia y Santa Catalina, Santander, Sucre, Tolima, Valle del Cauca]

<font size="+1">Practice</font>

Try it yourself! Group the properties in `colombia-real-estate-2` by department, and print the result.

In [ ]:
df2 = ...
dept_group = ...
dept_group.first()

Now that we have all the properties grouped by department, we might want to see the properties in just one of the departments. We can use the `get_group` method to do that. If we just wanted to see the properties in `"Santander"`, for example, the code would look like this:

In [ ]:
dept_group1 = df1.groupby("department")
dept_group1.get_group("Santander")

We can also make groups based on more than one category by adding them to the `groupby` method. After resetting the `df1` DataFrame, here's what the code looks like if we want to group properties both by `department` and by `property_type`.

In [ ]:
df1 = pd.read_csv("data/colombia-real-estate-1.csv")
dept_group2 = df1.groupby(["department", "property_type"])
dept_group2.first()

<font size="+1">Practice</font>

Try it yourself! Group the properties in `colombia-real-estate-2` by department and property type, and print the result.

In [ ]:
dept_group = ...
dept_group.first()

Finally, it's possible to use `groupby` to calculate aggregations. For example, if we wanted to find the average property area in each department, we would use the `.mean()` method. This is what the code for that looks like:

In [ ]:
dept_group = df1.groupby("department")["area_m2"].mean()
dept_group

*Practice*
Try it yourself! Use the `.mean` method in the `colombia-real-estate-2` dataset to find the average price in Colombian pesos (`"price_cop"`) for properties in each `"department"`.

In [ ]:
dept_group = ...
dept_group

# Subset a DataFrame's Columns Based on the Column Data Types

It's helpful to be able to find entries of a certain type, typically numerical entries, and put all of these in a separate DataFrame. Let's load a dataset to see how this works:

In [ ]:
mexico_city5 = pd.read_csv("./data/mexico-city-real-estate-5.csv")
mexico_city5.head

Now let's get only numerical entries:

In [ ]:
mexico_city5_numbers = mexico_city5.select_dtypes(include="number")
mexico_city5_numbers.head

Let's now find all entries which are not numerical entries:

In [ ]:
mexico_city5_no_numbers = mexico_city5.select_dtypes(exclude="number")
mexico_city5_no_numbers.head

<font size="+1">Practice</font> 

Create a subset of the DataFrame from `mexico-city-real-estate-5.csv` which excludes numbers. How many entries does it have?

In [ ]:
mexico_city3 = ...
mexico_city3_no_numbers = ...
print(mexico_city3_no_numbers.shape)

# Subset a DataFrame's columns based on column names

To subset a DataFrame by column names, you can either define a list of columns include or define a list of columns to exclude. Next, retain or drop the columns accordingly. For example, let's suppose we want to modify the `mexico_city3` dataset and only retain the first three columns. Let's define two lists, one with the columns to retain and one with the columns to drop:

In [ ]:
drop_cols = [
    "lat-lon",
    "price",
    "currency",
    "price_aprox_local_currency",
    "price_aprox_usd",
    "surface_total_in_m2",
    "surface_covered_in_m2",
    "price_usd_per_m2",
    "price_per_m2",
    "floor",
    "rooms",
    "expenses",
    "properati_url",
]

keep_cols = ["operation", "property_type", "place_with_parent_names"]

Next, we'll explore both approaches to subset `mexico_city3`. To retain columns based on `keep_cols`:

In [ ]:
mexico_city3_subsetted = mexico_city3[keep_cols]

To drop columns in `drop_cols`:

In [ ]:
mexico_city3_subsetted = mexico_city3.drop(columns=drop_cols)

<font size="+1">Practice</font> 

Create a subset of the DataFrame from `mexico-city-real-estate-3.csv` which excludes the last two columns.

## Pivot Tables

A pivot table allows to aggregate and summarize a DataFrame across multiple variables. For example, let's suppose we wanted to calculate the mean of the `price` column in the `mexico_city3` dataset for the different values in the `property_type` column:

In [ ]:
import numpy as np

mexico_city3_pivot = ...
mexico_city3_pivot

# Subsetting with Masks

Another way to to create subsets from a larger dataset is through **masking**. Masks are ways to filter out the data you're not interested in so that you can focus on the data that you are. For example, we might want to look at properties in Colombia that are bigger than 200 square meters. In order to create this subset, we'll need to use a mask. 

First, we'll reset our `df1` DataFrame so that we can draw on all the data in its original form. Then we'll create a statement and then assign the result to `mask`.

In [ ]:
df1 = pd.read_csv("data/colombia-real-estate-1.csv")
mask = df1["area_m2"] > 200
mask.head()

Notice that `mask` is a Series of Boolean values. Where properties are smaller than 200 square meters, our statement evaluates as `False`; where they're bigger than 200, it evaluates to `True`.

Once we have our mask, we can use it to select all the rows from `df1` that evaluate as `True`.

In [ ]:
df1[mask].head()

<font size="+1">Practice</font>

Try it yourself! Read `colombia-real-estate-2` into a DataFrame named `df2`, and create a mask to select all the properties that are smaller than 100 square meters.

In [ ]:
df2 = ...
mask = ...
df2[mask].head()

We can also create masks with multiple criteria using `&` for "and" and `|` for "or." For example, here's how we would find all properties in Atlántico that are bigger than 400 square meters.

In [ ]:
mask = (df1["area_m2"] > 400) & (df1["department"] == "Atlántico")
df1[mask].head()

<font size="+1">Practice</font>

Try it yourself! Create a mask for `df2` to select all the properties in Tolima that are smaller than 150 square meters.

In [ ]:
mask = ...
df2[mask].head()

## Reshape a DataFrame based on column values

## What's a pivot table?

A pivot table allows you to quickly aggregate and summarize a DataFrame using an aggregation function. For example, to build a pivot table that summarizes the mean of the `price_cop` column for each of the unique categories in the `property_type` column in `df2`:

In [ ]:
import numpy as np

pivot1 = pd.pivot_table(df2, values="price_cop", index="property_type", aggfunc=np.mean)
pivot1

<font size="+1">Practice</font>

Try it yourself! build a pivot table that summarizes the mean of the `price_cop` column for each of the unique departments in the `department` column in `df2`:

In [ ]:
# REMOVE {
pivot2 = pd.pivot_table(df2, values="price_cop", index="department", aggfunc=np.mean)
# REMOVE }
pivot2

## Combine multiple categories in a Series

Categorical variables can be collapsed into a fewer number of categories. One approach is to retain the values of the most frequently observed values and collapse all remaining values into a single category. For example, to retain only the values of the top 10 most frequent categories in the `department` column and then collapse the other categories together, use `value_counts` to generate the count of the values:

In [ ]:
df2["department"].value_counts()

Next, select just the top 10 using the `head()` method, and select the column names by using the `index` attribute of the series:

In [ ]:
top_10 = df2["department"].value_counts().head(10).index

Finally, use the apply method and a lambda function to select only the values from the `department` column and collapse the remaining values into the value `Other`:

In [ ]:
df2["department"] = df2["department"].apply(lambda x: x if x in top_10 else "Other")

<font size="+1">Practice</font>

Try it yourself! Retain the remaining top 5 most frequent values in the `department` column and collapse the remaining values into the category `Other`.